Revit 2026 API

# RebarConstraintsManagerAllowConstraintTargets Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool AllowConstraintTargets(
	RebarConstrainedHandle handle,
	IList<Reference> targetsToConstrain
)
```
```vb
Public Function AllowConstraintTargets (
	handle As RebarConstrainedHandle,
	targetsToConstrain As IList(Of Reference)
) As Boolean
```
```cpp
public:
bool AllowConstraintTargets(
	RebarConstrainedHandle^ handle,
	IList<Reference^>^ targetsToConstrain
)
```
```fsharp
member AllowConstraintTargets :
        handle : RebarConstrainedHandle *
        targetsToConstrain : IList<Reference> -> bool
```

#### Parameters

handle RebarConstrainedHandle

targetsToConstrain IListReference

#### Return Value

Boolean

#### Reference

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace